app/views/users/show.html.erb

      <p>List posts/comments/tweets</p>
        <% @user.posts.length %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1