app/controllers/forum_controller.rb

  def index
    @posts = Post.order(:created_at)
---
SELECT "posts".* FROM "posts" ORDER BY created_at

  def tech
    @posts = Post.find_all_by_category("Tech")
---
SELECT "posts".* FROM "posts" WHERE "posts"."category" = 'Tech' LIMIT 1

  def sports
    @posts = Post.find_all_by_category("Sports n' Tech")
---
SELECT "posts".* FROM "posts" WHERE "posts"."category" = 'Sports' LIMIT 1

  def gaming
    @posts = Post.find_all_by_category("Gaming")
---
SELECT "posts".* FROM "posts" WHERE "posts"."category" = 'Gaming'