app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY title
---
  def index
    @posts = Post.order("title")

INSERT INTO "posts" ("category", "content", "created_at", "image", "image_url", "name", "title", "updated_at", "user_email", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save