app/controllers/replies_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @reply = @post.replies.create(params[:reply])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "replies" ("by", "created_at", "post_id", "response", "updated_at", "user_email", "user_id", "user_username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)