app/controllers/users_controller.rb

INSERT INTO "users" ("admin", "bio", "created_at", "email", "fname", "hashed_password", "salted_password", "sname", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" ORDER BY email
---
  def index
    @users = User.order("email")

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    #@user = current_user
    @user = !params[:id].nil? ? User.find(params[:id]) : current_user

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def edit
    @user = !params[:id].nil? ? User.find(params[:id]) : current_user

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "image" = '1364179448_button_black_play.png', "updated_at" = '2013-04-09 02:00:38.012399' WHERE "users"."id" = 1
---
  def update
    @user = !params[:id].nil? ? User.find(params[:id]) : current_user
    respond_to do |format|
      if @user.update_attributes(params[:user])

DELETE FROM "users" WHERE "users"."id" = 3
---
  def destroy
    @user = User.delete(params[:id])